---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCTransformSetter.Create
zh: 创建、新建、生成、建立、新增
source: html/2e0cfc64-248e-7b65-56c2-eed05c2f0b71.htm
---
# Autodesk.Revit.DB.IFC.IFCTransformSetter.Create Method

**中文**: 创建、新建、生成、建立、新增

Creates a new instance of a transform setter.

## Syntax (C#)
```csharp
public static IFCTransformSetter Create()
```

## Returns
The new transform setter.